linux/tutorials/install/install.org
#+TITLE:     Debian快速安装指导
#+AUTHOR:    王晓林
#+EMAIL:     wx672ster@gmail.com
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+LATEX_CLASS: wx672ctexart

# (setq org-export-html-use-infojs nil)

* UEFI
现在（2018年10月）的电脑都很新潮，在主板上几乎都用UEFI取代了传统的BIOS。关于UEFI设置，我的
经验是：
- 把下列和Windows相关的选项都关掉（disable）:
  - =Secure boot=
  - =QuickBoot/FastBoot=
  - =Intel Smart Response Technology (SRT)=
  - =FastStartup=
- 如果在下面的安装过程中（硬盘分区的时候）看不到硬盘，那么你需要在UEFI设置里找到Intel Rapid Storage
  Technology (Intel RST)，把它设置为AHCI。
* 安装
安装Debian系统的大致步骤如下：
1. 先准备好一个安装盘（LiveUSB）。 【注意】 *一定要是64位的LiveUSB！*
   1) *下载:* [[http://mirrors.163.com/debian-cd/current/amd64/iso-cd/]]
      - 该目录中有三个（也许更多）iso文件，比如：
        : debian-9.5.0-amd64-netinst.iso        14-Jul-2018 19:12    291M
        : debian-9.5.0-amd64-xfce-CD-1.iso      14-Jul-2018 19:12    640M
        : debian-mac-9.5.0-amd64-netinst.iso    14-Jul-2018 19:12    294M
        下载名字最短的那个就好。
   2) *制作U盘:* 在Debian/Ubuntu平台上制作启动U盘非常简单，敲个命令就行了：
      #+BEGIN_SRC sh
      sudo cp debian-9.5.0-amd64-netinst.iso /dev/sdX
      sudo sync
      #+END_SRC
      【注意】
      1. 把 =debian-9.5.0-amd64-netinst.iso= 换成你下载的iso文件的名字。文件名太长容易敲错，
         那么就尽量用TAB键来补全。比如说，对于上面的长命令，你只需要键入前几个字母：
         #+BEGIN_SRC sh 
         sudo cp deb
         #+END_SRC
         然后按一下 =TAB= 键，长长的文件名就自动都补全了。
      2. 把 =X= 换成你的U盘对应的字母。用 =lsblk= 看一眼，你就知道是哪个字母了，通常不是b就是c。
2. 拔掉网线，从U盘重启系统，开始安装。大概半个小时，一个“最小系统”就装好了。
3. 完事后，拔掉U盘，重启系统。

   【注意】
   + 安装的时候不要选择中文语言环境，因为后面的安装配置工作都是在非图形环境下进行，
     采用中文的话，你很可能会遭遇乱码。
   + 硬盘分区的时候，
     - 如果你是装Linux单系统，就非常简单，没啥可说的；
     - 如果你是要装双系统（保留原来的Windows），那么，有三点烦，
       1. 可用空间不够怎么办？删掉哪个分区？如何压缩原来的Windows分区？总之，烦！
       2. 以后，霸道的Windows每次升级、更新，都会让你的Linux消失……
       3. 装了双系统之后，通常（不争气的）你会选用熟悉的Windows系统，渐渐地，过不了多久，你就忘了电
          脑上还有一个Linux系统。
       所以，我很不愿意搭理装双系统的人。
# 4. 如果Debian系统起不来，或者GRUB2菜单里面的Windows出现问题，
#    那么就找一个功能稍微全面点的LiveUSB，比如Ubuntu安装盘。
#    从U盘启动，选择 =Try Ubuntu=, 然后运行 =boot-repair= 来修复一下。
#    - *Boot-Repair:* https://help.ubuntu.com/community/Boot-Repair

* 安装配置
# 下面的安装配置说明完全是针对Debian系统。我们学院的机房系统已经统一换成了Debian Testing。
# 而且去掉了容易出毛病的花哨界面，只用 =startx= + =sawfish= 。
# 这也许不算完美，但它简单、可靠、高效。除此之外，你还需要什么呢？
  
最小系统装好之后，拔出U盘，重启系统。现在我们讲讲之后的事情……
1. 第一件事当然是把网线插好，启动你崭新的Debian，在屏幕提示下，输入用户名、密码。
   之后，你就可以通过输入命令来让电脑为你工作了。

   #+BEGIN_QUOTE
   【注意】如果你的笔记本比较新潮，比如我新买的华为Honor Magicbook，没提供有线网接口，而且
   我们刚装好的最小系统里没有本机的无线网卡驱动，那么，请先参看[[#app1][本文末尾的附录：没有有线网卡怎么办？]]
   联网之后再继续。
   #+END_QUOTE

   好了，假设你解决了所有的网络问题，现在我们可以继续了……一个“最小系统”干不了多少事情，所
   以我们先要安装更多的应用程序。注意，安装配置系统是管理员的工作，所以下面的操作都需要以
   管理员的身份来进行。如果你没有以管理员的身份登录（命令行提示符是 =$= ），那么你现在就输
   入命令：
   : $ su
   然后输入管理员密码，你就成为管理员了（命令行提示符变成了 =#= ）。注意看命令行的提示符：
   - =$= 代表普通用户；
   - =#= 代表root。
     
   【注意】如果你在安装最小系统的时候没有设置root密码，那么现在显然无法用 =su= 命令，那么
   你直接用 =sudo= 命令就好了。
   
   后面的安装配置工作显然是需要联网的，所以，先检查一下你的网络状况：
   #+BEGIN_SRC sh
   ip a
   #+END_SRC
   上面这行命令会列出你所有的网卡。仔细看一下，是否有一块网卡叫 =ethX= (=X= 是个数字，
   通常就是 =0=. 如果是 =1= 或者 =2= 也没关系)，或者叫 =enpXsY= (=X= 和 =Y= 都是数字)。仔细看看这块网卡是否已经获取到了IP地址。
   如果你能看到类似下面这行信息，那就没问题了。
   : inet 192.168.1.110/24 brd 192.168.1.255 scope global dynamic eth0
   上面一行中的 =192.168.1.110= 就是我的 =eth0= 网卡获取到的IP地址。如果你看不到这样一
   行，那么先检查一下网线是否插好了，然后敲命令：
   #+BEGIN_SRC sh
   dhclient enpXsY
   #+END_SRC
   【注意】 =enpXsY= 是你的有线网卡的名字，也许是 =ethX= 。把 =X,Y= 换成相应的数字。

   上面这条命令就是用来获取IP地址的。没什么意外的话，你马上就可以获取到IP了。之后，再敲
   =ip a= 命令确认一下。还可以 =ping= 一下，比如 =mirrors.163.com= 看看网络是否联通了。

   【注意】如果你用的是无线网卡，那么关于联网密码设置问题，请先参看[[#app2][本文末尾的附录：无线联网时的密码设置]]。
      
2. 修改 =sources.list= 文件
   #+BEGIN_SRC sh 
   nano /etc/apt/sources.list
   #+END_SRC
   把这个文件里原有的内容全部删除掉，然后添加下面这三行：
   #+BEGIN_EXAMPLE
   deb http://mirrors.163.com/debian testing main non-free contrib
   deb http://mirrors.163.com/debian testing-updates main non-free contrib
   deb http://mirrors.163.com/debian testing-proposed-updates main non-free contrib
   #+END_EXAMPLE

3. 存盘退出后，刷新一下软件包列表，并更新你的最小系统：
   #+BEGIN_SRC sh
   apt update && apt dist-upgrade
   #+END_SRC
   网络顺畅的话，这一步要花十几分钟的时间。
4. 现在，“机房装了什么，我就要装什么”。那就先把机房系统的软件清单弄到手，在[[https://cs6.swfu.edu.cn/~wx672/debian-install/list.laptop][这里]]。
   这是我个人Debian笔记本电脑上的软件包列表。用 =wget= 把[[https://gitlab.swfu.edu.cn/wx672/lecture_notes/blob/master/linux/tutorials/install/deb-pkg-list/laptop][这个软件清单]]下载：
   #+BEGIN_SRC sh
   cd

   wget  https://cs6.swfu.edu.cn/~wx672/lecture_notes/linux/tutorials/install/deb-pkg-list/laptop
   #+END_SRC
   【注意】这一步要以普通用户的身份来做，不要用root！注意看命令行的提示符：
   - =$= 代表普通用户；
   - =#= 代表root；
   - 如果[[https://cs6.swfu.edu.cn/]]这个网址不好使的话，你可以试试：
     - https://github.com/wx672/lecture-notes/blob/master/linux/tutorials/install/deb-pkg-list/laptop
5. 然后，开始大批量安装软件包：
   #+BEGIN_SRC sh
   apt-get install $(cat laptop)
   #+END_SRC
   
   如果网络顺畅的话，这一步大概需要半个小时。通常，安装过程是不需要人为干预的。但有的软件
   包在安装过程中，会停下来问你「Yes/no」。这种时候，你最好耐心把屏幕提示看明白。一般来讲，
   直接按「回车」就好。
6. 一切顺利的话，网卡、声卡、显卡……都不需要额外的操心。但如果运气不太好的话（这通常是人品
   问题，因为你以学习的名义向家里要钱，最终却为了玩游戏而买了个声卡、显卡都特新潮的游戏机），
   那么……假设你幡然悔悟了，可以看看本文末尾的附录：[[#app3][关于硬件配置]]。
7. 如果像我一样，你也是[[#app2][用USB无线网卡完成的安装]]，那么现在你应该可以拔掉USB无线网卡了。同时
   把刚才添加进 =/etc/network/interfaces= 文件的四行删除，或者注释掉。重启系统之后，用
   =nmtui= 来连接无线网：
   #+BEGIN_SRC sh
   sudo nmtui
   #+END_SRC
   这是个界面挺友好的小工具，不用人教，你就会用。
      
** 配置

*** sudo
=sudo= 的时候总要问密码，是不是很烦？那就不让它问了：
1. 变身root
   #+BEGIN_SRC sh
   su
   #+END_SRC
   输入密码，变成root。然后，
2. 建立一个新文件
   #+BEGIN_SRC sh
   nano /etc/sudoers.d/your-user-name
   #+END_SRC
   【注意】把 =your-user-name= 改成你自己的用户名。
3. 在里面写这么一行：
   : your-user-name  ALL = NOPASSWD: ALL
   【注意】把 =your-user-name= 改成你自己的用户名。
4. 改一下权限：
   #+BEGIN_SRC sh
   chmod 0440 /etc/sudoers.d/your-user-name
   #+END_SRC
   这以后 =sudo= 就不再问密码了。
5. 退回普通用户身份：
   #+BEGIN_SRC sh
   exit
   #+END_SRC
