linux/tutorials/install/install.tex
% Created 2019-05-28 Tue 21:55
% Intended LaTeX compiler: pdflatex
\documentclass{wx672ctexart}
		\usepackage{wx672common}
\usepackage{wx672hyperref}
\usepackage{wx672minted}
\author{王晓林}
\date{\today}
\title{Debian快速安装指导}
\hypersetup{
 pdfauthor={王晓林},
 pdftitle={Debian快速安装指导},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2.3)}, 
 pdflang={Cn}}
\begin{document}

\maketitle
\tableofcontents


\section{UEFI}
\label{sec:org902f24c}
现在（2018年10月）的电脑都很新潮，在主板上几乎都用UEFI取代了传统的BIOS。关于UEFI设置，我的经验是：
\begin{itemize}
\item 把下列和Windows相关的选项都关掉（disable）:
\begin{itemize}
\item \texttt{Secure boot}
\item \texttt{QuickBoot/FastBoot}
\item \texttt{Intel Smart Response Technology (SRT)}
\item \texttt{FastStartup}
\end{itemize}
\item 如果在下面的安装过程中（硬盘分区的时候）看不到硬盘，那么你需要在UEFI设置里找到Intel Rapid Storage
Technology (Intel RST)，把它设置为AHCI。
\end{itemize}
\section{安装}
\label{sec:orgbaf76a9}
安装Debian系统的大致步骤如下：
\begin{enumerate}
\item 先准备好一个安装盘（LiveUSB）。 【注意】 \textbf{一定要是64位的LiveUSB！}
\begin{enumerate}
\item \textbf{下载:} \url{http://mirrors.163.com/debian-cd/current/amd64/iso-cd/}
\begin{itemize}
\item 该目录中有三个（也许更多）iso文件，比如：
\begin{verbatim}
debian-9.5.0-amd64-netinst.iso        14-Jul-2018 19:12    291M
debian-9.5.0-amd64-xfce-CD-1.iso      14-Jul-2018 19:12    640M
debian-mac-9.5.0-amd64-netinst.iso    14-Jul-2018 19:12    294M
\end{verbatim}

只下载最小的那一个就好。
\end{itemize}
\item \textbf{制作U盘:} 在Debian/Ubuntu平台上制作启动U盘非常简单，（以Debian为例）敲个命令就行了：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo cp debian-9.5.0-amd64-netinst.iso /dev/sdX
sudo sync
\end{minted}
【注意】
\begin{enumerate}
\item 把 \texttt{debian-9.5.0-amd64-netinst.iso} 换成你下载的iso文件的名字。文件名太长容易敲错，
那么就尽量用TAB键来补全。比如说，对于上面的长命令，你只需要键入前几个字母：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo cp deb
\end{minted}
然后按一下 \texttt{TAB} 键，长长的文件名就自动都补全了。
\item 把 \texttt{X} 换成你的U盘对应的字母。用 \texttt{lsblk} 看一眼，你就知道是哪个字母了，通常不是b就是c。
\end{enumerate}
\end{enumerate}
\item 拔掉网线，从U盘重启系统，开始安装。大概半个小时，一个“最小系统”就装好了。
\item 完事后，拔掉U盘，重启系统。

【注意】
\begin{itemize}
\item 安装的时候不要选择中文语言环境，因为后面的安装配置工作都是在非图形环境下进行，
采用中文的话，你很可能会遭遇乱码。
\item 硬盘分区的时候，
\begin{itemize}
\item 如果你是装Linux单系统，就非常简单，没啥可说的；
\item 如果你是要装双系统（保留原来的Windows），那么，有三点烦，
\begin{enumerate}
\item 可用空间不够怎么办？删掉哪个分区？如何压缩原来的Windows分区？总之，烦！
\item 以后，霸道的Windows每次升级、更新，都会让你的Linux消失……
\item 装了双系统之后，通常（不争气的）你会选用熟悉的Windows系统，渐渐地，过不了多久，你就忘了电脑上还有一个Linux系统。
\end{enumerate}
所以，我很不愿意搭理装双系统的人。
\end{itemize}
\end{itemize}
\end{enumerate}

\section{安装配置}
\label{sec:orgcfbfe32}
最小系统装好之后，拔出U盘，重启系统，现在我们讲讲之后的事情……
\begin{enumerate}
\item 第一件事当然是把网线插好，启动你崭新的Debian，在屏幕提示下，输入用户名、密码。
之后，你就可以通过输入命令来让电脑为你工作了。

\begin{quote}
【注意】如果你的笔记本比较新潮，比如我新买的华为Honor Magicbook，没提供有线网接口，而且我们刚装好的最小系统里没有本机的无线网卡驱动，那么，请先参看\hyperref[sec:org3378f41]{本文末尾的附录：没有有线网卡怎么办？}
联网之后再继续。
\end{quote}

好了，假设你解决了所有的网络问题，现在我们可以继续了……一个“最小系统”干不了多少事情，所以我们先要安装更多的应用程序。注意，安装配置系统是管理员的工作，所以下面的操作都需要以管理员的身份来进行。如果你没有以管理员的身份登录（命令行提示符是 \texttt{\$} ），那么你现在就输入命令：
\begin{verbatim}
$ su
\end{verbatim}

然后输入管理员密码，你就成为管理员了（命令行提示符变成了 \texttt{\#} ）。注意看命令行的提示符：
\begin{itemize}
\item \texttt{\$} 代表普通用户；
\item \texttt{\#} 代表root。
\end{itemize}

【注意】如果你在安装最小系统的时候没有设置root密码，那么现在显然无法用 \texttt{su} 命令，那么你直接用 \texttt{sudo} 命令就好了。

后面的安装配置工作显然是需要联网的，所以，先检查一下你的网络状况：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
ip a
\end{minted}
上面这行命令会列出你所有的网卡。仔细看一下，是否有一块网卡叫 \texttt{ethX} (\texttt{X} 是个数字，
通常就是 \texttt{0}. 如果是 \texttt{1} 或者 \texttt{2} 也没关系)，或者叫 \texttt{enpXsY} (\texttt{X} 和 \texttt{Y} 都是数字)。仔细看看这块网卡是否已经获取到了IP地址。
如果你能看到类似下面这行信息，那就没问题了。
\begin{verbatim}
inet 192.168.1.110/24 brd 192.168.1.255 scope global dynamic eth0
\end{verbatim}

上面一行中的 \texttt{192.168.1.110} 就是我的 \texttt{eth0} 网卡获取到的IP地址。如果你看不到这样一行，那么先检查一下网线是否插好了，然后敲命令：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
dhclient enpXsY
\end{minted}
【注意】 \texttt{enpXsY} 是你的有线网卡的名字，也许是 \texttt{ethX} 。把 \texttt{X,Y} 换成相应的数字。

上面这条命令就是用来获取IP地址的。没什么意外的话，你马上就可以获取到IP了。之后，再敲 \texttt{ip a} 命令确认一下。还可以 \texttt{ping} 一下 \texttt{cs2.swfu.edu.cn} 看看网络是否联通了。

【注意】如果你用的是无线网卡，那么关于联网密码设置问题，请先参看\hyperref[sec:orgc0a8978]{本文末尾的附录：无线联网时的密码设置}。

\item 修改 \texttt{sources.list} 文件
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
nano /etc/apt/sources.list
\end{minted}
把这个文件里原有的内容全部删除掉，然后添加下面这三行：
\begin{verbatim}
deb http://mirrors.163.com/debian testing main non-free contrib
deb http://mirrors.163.com/debian testing-updates main non-free contrib
deb http://mirrors.163.com/debian testing-proposed-updates main non-free contrib
\end{verbatim}

\item 存盘退出后，刷新一下软件包列表，并更新你的最小系统：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
apt update && apt dist-upgrade
\end{minted}
网络顺畅的话，这一步要花十几分钟的时间。
\item 现在，“机房装了什么，我就要装什么”。那就先把机房系统的软件清单弄到手，在\href{http://cs2.swfu.edu.cn/\~wx672/debian-install/list.laptop}{这里}。
这是我个人Debian笔记本电脑上的软件包列表。用 \texttt{wget} 把\href{http://cs2.swfu.edu.cn/\~wx672/debian-install/list.laptop}{这个软件清单}下载：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
cd
wget http://cs2.swfu.edu.cn/~wx672/debian-install/list.laptop
\end{minted}
【注意】这一步要以普通用户的身份来做，不要用root！注意看命令行的提示符：
\begin{itemize}
\item \texttt{\$} 代表普通用户；
\item \texttt{\#} 代表root；
\end{itemize}
\item 然后，开始大批量安装软件包：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
apt install `cat list.laptop`
\end{minted}
【注意】这行命令中用到的单引号是 \texttt{`} ，也就是键盘左上角的那个，而不是 \texttt{'} ，回车键左边这一个。95\%的同学会在这里出错。

如果网络顺畅的话，这一步大概需要半个小时。通常，安装过程是不需要人为干预的。但有的软件包在安装过程中，会停下来问你「Yes/no」。这种时候，你最好耐心把屏幕提示看明白。一般来讲，
直接按「回车」就好。
\item 一切顺利的话，网卡、声卡、显卡……都不需要额外的操心。但如果运气不太好的话（这通常是人品问题，因为你以学习的名义向家里要钱，最终却为了玩游戏而买了个声卡、显卡都特新潮的游戏机），
那么……假设你幡然悔悟了，可以看看本文末尾的附录：\hyperref[sec:org57926af]{关于硬件配置}。
\item 如果像我一样，你也是\hyperref[sec:orgc0a8978]{用USB无线网卡完成的安装}，那么现在你应该可以拔掉USB无线网卡了。同时把刚才添加进 \texttt{/etc/network/interfaces} 文件的四行删除，或者注释掉。重启系统之后，用
\texttt{nmtui} 来连接无线网：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo nmtui
\end{minted}
这是个界面挺友好的小工具，不用人教，你就会用。
\end{enumerate}

\subsection{配置}
\label{sec:orgadd5732}

\subsubsection{sudo}
\label{sec:org070412a}
\texttt{sudo} 的时候总要问密码，是不是很烦？那就不让它问了：
\begin{enumerate}
\item 变身root
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
su
\end{minted}
输入密码，变成root。然后，
\item 建立一个新文件
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
nano /etc/sudoers.d/your-user-name
\end{minted}
【注意】把 \texttt{your-user-name} 改成你自己的用户名。
\item 在里面写这么一行：
\begin{verbatim}
your-user-name  ALL = NOPASSWD: ALL
\end{verbatim}

【注意】把 \texttt{your-user-name} 改成你自己的用户名。
\item 改一下权限：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
chmod 0440 /etc/sudoers.d/your-user-name
\end{minted}
这以后 \texttt{sudo} 就不再问密码了。
\item 退回普通用户身份：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
exit
\end{minted}
\end{enumerate}
