linux/tutorials/install/install.org
*** COMMENT dotfile
现在你的系统和机房的差不多一样了，唯一的差别就是你还没配置呢。
配置是个琐碎事，比较省事的办法就是把我的配置文件拷贝过来。最省事的拷贝方式就是
git（ *以普通用户的身份来做* ）：
#+BEGIN_SRC sh
cd

git clone https://github.com/wx672/dotfile.git
#或者
git clone https://cs6.swfu.edu.cn/~wx672/dotfile/.git
#+END_SRC

上面三个网址应该都可以。 =git= 是著名的源代码管理工具，也就是版本控制工具。用它来管理配置文
件也非常顺手。上面的命令完成之后， =ls= 一下，应该可以看到，你的 =$HOME= 目录里多了一个子
目录 =dotfile= ，里面放的都是杂七杂八的配置文件。
       
现在把 =dotfile= 目录里所有以 =dot.= 开头的文件和目录都链接到 =$HOME= 目录里，
1) 先确保你在 =$HOME=:
   #+BEGIN_SRC sh
   cd
   #+END_SRC
2) 把旧的 =.bash*= 文件都删掉：
   #+BEGIN_SRC sh
   rm -f .bash*
   #+END_SRC
3) 做链接：
   #+BEGIN_SRC sh
   ln -sf dotfile/dot.* .
   ln -sf dotfile/help/dot.* .
   #+END_SRC
   现在 =ls= 一下，你会发现 =$HOME= 目录里有了很多 =dot.= 开头的文件。
4) 把所有的 =dot.= 都变成 =.=, 也就是把文件名前面的 =dot= 都去掉，只留下 =.=:
   #+BEGIN_SRC sh
   rename 's/dot//' dot.*
   #+END_SRC
   现在用 =ls -al= 检查一下，我们需要的配置文件（也就是‘点’开头的文件）应该都在 =$HOME= 目录里了。
5) 顺手把我准备好的「帮助墙纸」也下载下来吧。墙纸上列出了我们最常用的快捷键。
   #+BEGIN_SRC sh
   wget -O .keys.png https://cs6.swfu.edu.cn/~wx672/debian-install/keys.png
   #+END_SRC
   等以后在XWindow环境下，按 =Super-F1= 应该就可以弹出这张墙纸了。
  （ =Super= 键就是键盘左下方的 =Win= 键）

  # 【注意】 由于网络管控加强了， =cs2.swfu.edu.cn= 的域名解析被关掉了，所以，你要修改一下
  #  =/etc/hosts= 文件。很简单，在这个文件里添加如下一行：
  #  : 202.203.132.242  cs2.swfu.edu.cn
6) 我的Emacs配置里用到了很多插件，自然你也需要它们，否则Emacs不能正常工作。
   1) 先把我的插件包下载下来
      #+BEGIN_SRC sh
      wget http://cs6.swfu.edu.cn/~wx672/debian-install/elpa.tgz
      #+END_SRC
   2) 放到Emacs的配置文件目录里
      #+BEGIN_SRC sh
      mv elpa.tgz ~/.emacs.d/
      #+END_SRC
   3) 然后解压缩
      #+BEGIN_SRC sh
      cd ~/.emacs.d
      tar zxf elpa.tgz
      #+END_SRC
   4) 测试一下
      #+BEGIN_SRC sh
      emacs --debug-init
      #+END_SRC
      如果报错，就把出错信息发给我（wx672ster@gmail.com）。  
      当然，如果你能自己解决问题那再好不过了。
*** Auto login
简单起见，我们只讲“怎么做”，先不管“为什么”。（需要sudo，也就是用root身份来做）
1. 拷贝配置文件
   #+BEGIN_SRC sh
   sudo cp -r ~/dotfile/etc/systemd/system/getty@tty1.service.d/ /etc/systemd/system/
   #+END_SRC
   注意, =~= (也就是波浪线), 它代表你的 =$HOME= 目录。
2. 修改
   #+BEGIN_SRC sh
   sudo nano /etc/systemd/system/getty@tty1.service.d/override.conf
   #+END_SRC
   在这个 =override.conf= 文件里应该只有如下三行：
   #+BEGIN_EXAMPLE
   [Service]
   ExecStart=
   ExecStart=-/sbin/agetty --autologin wx672 --noclear %I $TERM
   #+END_EXAMPLE
   你只要把其中的 =wx672= 改成你自己的用户名就可以了。

*** 中文语言环境
注意，我们其实并不需要一套纯正的中文环境，我们只是需要输入和阅读中文。
其它方面，比如窗口菜单、提示信息、man page，我觉得还是看英文比较好。

千万别说“我英文差，还是用中文算了”。要知道，就是因为你
“这个差、那个不行、这个不懂、那个不会……”所以你才来上学的，不是吗？
既然知道“差”，那就该好好学习，提高它。
英文是用熟的，如果你总是回避它，就总也不会长进了。

好了，下面我们来配置一个简单的中文环境。相关中文字体我们已经安装好了。下面只需要：
1. 安装中文字体和输入法。
   #+BEGIN_SRC sh
   cd
   wget https://cs6.swfu.edu.cn/~wx672/debian-install/list.chinese
   sudo apt install `cat list.chinese`
   #+END_SRC

2. 选择 =locale=
   #+BEGIN_SRC sh
   sudo dpkg-reconfigure locales
   #+END_SRC
   在这一长串列表中，只要选中
   - [X] =en_US.UTF-8 UTF-8=
   - [X] =zh_CN.GB18030 GB18030=
   - [X] =zh_CN.UTF-8 UTF-8=
   就可以了。默认语言环境选 =None= 。
3. 拷贝一个小配置文件：
   #+BEGIN_SRC sh
   sudo cp ~/dotfile/etc/default/locale /etc/default
   #+END_SRC
4. 顺带再拷贝一个小文件：
   #+BEGIN_SRC sh
   sudo cp ~/dotfile/etc/default/keyboard /etc/default
   #+END_SRC
   这是把你的 =CapsLock= 键变成 =Ctrl= 键，
   因为Unix用户经常要用 =Ctrl= 键，从来不用 =CapsLock= 。

   好了，现在安装配置的工作基本就结束了。你可以重启一下系统。
   系统重启后，看到的应该就是学院机房里那个没有桌面的“桌面系统”了。
   不记得快捷键了？按 =Super-F1= 。

   中文输入法，我选用的是 =fcitx=, 因为感觉它的bug要少一些，比较稳定。
   如果你需要配置它的话，就：
   #+BEGIN_SRC sh
   fcitx-configtool
   #+END_SRC
   你最好和我一样，用 =Shift-space= 来激活输入法，因为 =Ctrl-space= 在Emacs里有特殊用途。

   注意：fcitx依赖于dbus-x11，而显然fcitx软件包的维护者忽略了这个小细节。那么我们就自己把
   它装上呗：
   #+BEGIN_SRC sh
   sudo apt install dbus-x11
   #+END_SRC
*** Windows fonts （非必须）                                       :noexport:
Windows系统我不喜欢，但Windows的中文字体还是不错的。
如果你装的是双系统，那么你可以直接从Windows的 =C:\= 盘把字体文件拷贝过来。

如果你和我一样，只装了一个Debian系统，那么就这样：
#+BEGIN_SRC sh
#1. 先下载：
wget http://cs6.swfu.edu.cn/~wx672/debian-install/mstt-chinese.tgz
#2. 解压缩：
tar zxf mstt-fonts-chinese.tgz
#3. 放到该放的地方：
sudo mv msfonts-cn /usr/share/fonts/truetype/
#+END_SRC

*** multiarch （非必须）                                           :noexport:
我们现在一般都是用64位的笔记本电脑，所以我们都是装64位的Linux系统。但有时还是要用到32位的
应用程序。比如在宿舍上网就要用到DrClient认证客户端，它就是个32位应用程序。当你运行它的时候，
肯定会报错，告诉你说缺少某个函数库。所以说，我们的系统还是要支持32位程序才行。怎么办呢？很
简单，
#+BEGIN_SRC sh
sudo dpkg --add-architecture i386
sudo apt update
#+END_SRC
然后，以后再报错说缺少某个32位的函数库的话，就：
#+BEGIN_SRC sh
sudo apt search the-32bit-lib-package
#+END_SRC
找到之后，就
#+BEGIN_SRC sh
sudo apt install the-32bit-lib-package
#+END_SRC
就可以了。注意，通常32位软件包的后面都会有个 =:i386= 做后缀。
不带后缀的都是64位软件包。

* 附录：没有有线网卡怎么办？
:PROPERTIES:
:CUSTOM_ID: app1
:END:

办法很多：
1. 用Android手机的USB Tethering功能。以我自己的手机系统为例（LineageOS 16.0/Android 9），
   很简单，
   1) 用USB线连接手机和电脑；
   2) 在手机的「系统设置」里有个搜索框，在里面输入“tethering”，马上就能找到“Hotspot &
      Tethering”，激活里面的USB Tethering功能就行了；
   3) 在电脑上，敲命令 =ip a= 应该能看到一块有线网卡。比如，
      #+BEGIN_EXAMPLE
      3: enp2s0f4u2: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UNKNOWN group default qlen 1000
         link/ether 26:b1:c7:c5:02:1f brd ff:ff:ff:ff:ff:ff
      #+END_EXAMPLE
      从上面的屏幕输出信息可以看到，这块有线网卡的名字是 =enp2s0f4u2= 。然后，以root身份，
      敲下面这条命令：
      #+BEGIN_SRC sh
      sudo dhclient enp2s0f4u2
      #+END_SRC
      你就可以获得一个IP地址了，也就是说，你已经成功联网了。
2. 去找一个USB无线网卡试试。我找到一个Realtek的指甲盖大小的USB无线网卡，不需要驱动，插上就
   能用。我也尝试过两个比较古老的tp-link无线网卡，不好使。
3. 另外，如果你真的和我一样，用的是华为Honor Magicbook，那么也许你不必去找USB网卡，可以先
   试试能否让内置网卡工作。Magicbook的内置网卡是Intel的。既然完成后面的安装步骤之后它能正
   常工作，那我想，现在使使劲应该也能解决问题吧。但毕竟我还没有亲自尝试过，所以只能先给出
   一些想法：
   - 之所以内置网卡暂时不工作，我怀疑是我们用来安装最小系统的iso文件不够新。它是以Debian稳
     定版（stretch）为基础做出来的，其中的内核（4.9）和相应固件（firmware-iwlwifi）都偏旧，
     可能尚不支持这么新潮（2018年）的硬件。所以，可以试试把内核和相应固件从稳定版更新到测
     试版（buster）。在没有网络连接的情况下，显然这需要我们另找办法下载，并手动安装一些软
     件包，包括：
     * [[https://packages.debian.org/buster/linux-image-amd64][linux-image-amd64]]
     * [[https://packages.debian.org/buster/firmware-iwlwifi][firmware-iwlwifi]]
     * 还有若干被上述两个软件包依赖的软件包
   - 一些参考链接：
     * [[https://unix.stackexchange.com/questions/283722/how-to-connect-to-wifi-from-command-line][How to connect to WiFi from command line?]]
     * [[https://askubuntu.com/questions/974/how-can-i-install-software-or-packages-without-internet-offline][How can I install software packages without Internet?]]
     * [[https://commandlinefanatic.com/cgi-bin/showarticle.cgi?article=art016][Installing Debian without a Network]]
     * [[https://wiki.debian.org/WiFi][Debian Wiki --- WiFi]]       
4. 如果上述办法都不成功，那么这招肯定行，就是笨点。直接去下面这些镜像站下载完整的安装盘。
   - http://mirrors.163.com/debian-cd/current/amd64/iso-dvd/
   - [[http://mirrors.ustc.edu.cn/debian-cd/current/amd64/iso-dvd/]]

   完整的DVD安装盘包含3个iso文件，你可以先下载第一个试试。如果里面有了你需要的无线网卡驱动
   和相关程序，那么激活网卡之后，你就可以直接网络安装了，无需下载其它的iso文件了。

** 无线联网时的密码设置
:PROPERTIES:
:CUSTOM_ID: app2
:END:

无线联网时通常是要输入密码的，所以我们需要修改一个配置文件 =/etc/network/interfaces= ，很
简单，编辑这个小文件：
#+BEGIN_SRC sh
sudo nano /etc/network/interfaces
#+END_SRC
=nano= 是个很简单的编辑器，用起来应该不会有什么困难吧。 
=nano= 窗口的最下两行都是快捷键提示，最重要的两个是：
1. 存盘： =Ctrl-o=
2. 退出： =Ctrl-x=

在这个文件的最后加上如下几行：
#+BEGIN_EXAMPLE
iface tmp inet dhcp
wireless-essid MY-ESSID
wpa-ssid MY-ESSID
wpa-psk PASSWORD
#+END_EXAMPLE
【注意】把 =MY-ESSID= 和 =PASSWORD= 换成你自己的无线网络的名字和密码。

然后，用下面这条命令来连接无线网：
#+BEGIN_SRC sh
sudo ifup WLANCARD=tmp
#+END_SRC
【注意】把 =WLANCARD= 换成你自己的无线网卡的名字，网卡的名字通常是w开头的，比如我的无线
网卡名字就是 =wlp1s0= ，那么我用的联网命令就是：
#+BEGIN_SRC sh
sudo ifup wlp1s0=tmp
#+END_SRC

