linux/tutorials/install/install.tex
\subsubsection{dotfile}
\label{sec:orgc7ea5bf}
现在你的系统和机房的差不多一样了，唯一的差别就是你还没配置呢。
配置是个琐碎事，比较省事的办法就是把我的配置文件拷贝过来。最省事的拷贝方式就是
git（ \textbf{以普通用户的身份来做} ）：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
cd
git clone http://cs2.swfu.edu.cn/~wx672/dotfile/.git
#或者
git clone https://gitlab.swfu.edu.cn/wx672/dotfile.git
#或者
git clone https://github.com/wx672/dotfile.git
\end{minted}

上面三个网址应该都可以。 \texttt{git} 是著名的源代码管理工具，也就是版本控制工具。用它来管理配置文件也非常顺手。上面的命令完成之后， \texttt{ls} 一下，应该可以看到，你的 \texttt{\$HOME} 目录里多了一个子目录 \texttt{dotfile} ，里面放的都是杂七杂八的配置文件。

现在把 \texttt{dotfile} 目录里所有以 \texttt{dot.} 开头的文件和目录都链接到 \texttt{\$HOME} 目录里，
\begin{enumerate}
\item 先确保你在 \texttt{\$HOME}:
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
cd
\end{minted}
\item 把旧的 \texttt{.bash*} 文件都删掉：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
rm -f .bash*
\end{minted}
\item 做链接：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
ln -sf dotfile/dot.* .
ln -sf dotfile/help/dot.* .
\end{minted}
现在 \texttt{ls} 一下，你会发现 \texttt{\$HOME} 目录里有了很多 \texttt{dot.} 开头的文件。
\item 把所有的 \texttt{dot.} 都变成 \texttt{.}, 也就是把文件名前面的 \texttt{dot} 都去掉，只留下 \texttt{.}:
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
rename 's/dot//' dot.*
\end{minted}
现在用 \texttt{ls -al} 检查一下，我们需要的配置文件（也就是‘点’开头的文件）应该都在 \texttt{\$HOME} 目录里了。
\item 顺手把我准备好的「帮助墙纸」也下载下来吧。墙纸上列出了我们最常用的快捷键。
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
wget -O .keys.png http://cs2.swfu.edu.cn/~wx672/tex-fun/keys/keys-1.png
\end{minted}
 等以后在XWindow环境下，按 \texttt{Super-F1} 应该就可以弹出这张墙纸了。
（ \texttt{Super} 键就是键盘左下方的 \texttt{Win} 键）
\item 我的Emacs配置里用到了很多插件，自然你也需要它们，否则Emacs不能正常工作。
\begin{enumerate}
\item 先把我的插件包下载下来
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
wget http://cs2.swfu.edu.cn/~wx672/debian-install/elpa.tgz
\end{minted}
\item 放到Emacs的配置文件目录里
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
mv elpa.tgz ~/.emacs.d/
\end{minted}
\item 然后解压缩
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
cd ~/.emacs.d
tar zxf elpa.tgz
\end{minted}
\item 测试一下
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
emacs --debug-init
\end{minted}
如果报错，就把出错信息发给我（wx672ster@gmail.com）。  
当然，如果你能自己解决问题那再好不过了。
\end{enumerate}
\end{enumerate}
\subsubsection{Auto login}
\label{sec:orge980901}
简单起见，我们只讲“怎么做”，先不管“为什么”。（需要sudo，也就是用root身份来做）
\begin{enumerate}
\item 拷贝配置文件
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo cp -r ~/dotfile/etc/systemd/system/getty@tty1.service.d/ /etc/systemd/system/
\end{minted}
注意, \texttt{\textasciitilde{}} (也就是波浪线), 它代表你的 \texttt{\$HOME} 目录。
\item 修改
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo nano /etc/systemd/system/getty@tty1.service.d/override.conf
\end{minted}
在这个 \texttt{override.conf} 文件里应该只有如下三行：
\begin{verbatim}
[Service]
ExecStart=
ExecStart=-/sbin/agetty --autologin wx672 --noclear %I $TERM
\end{verbatim}
你只要把其中的 \texttt{wx672} 改成你自己的用户名就可以了。
\end{enumerate}

\subsubsection{中文语言环境}
\label{sec:org3fbebb1}
注意，我们其实并不需要一套纯正的中文环境，我们只是需要输入和阅读中文。
其它方面，比如窗口菜单、提示信息、man page，我觉得还是看英文比较好。

千万别说“我英文差，还是用中文算了”。要知道，就是因为你
“这个差、那个不行、这个不懂、那个不会……”所以你才来上学的，不是吗？
既然知道“差”，那就该好好学习，提高它。
英文是用熟的，如果你总是回避它，就总也不会长进了。

好了，下面我们来配置一个简单的中文环境。相关中文字体我们已经安装好了。下面只需要：
\begin{enumerate}
\item 安装中文字体和输入法。
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
cd
wget http://cs2.swfu.edu.cn/~wx672/debian-install/list.chinese
sudo apt install `cat list.chinese`
\end{minted}

\item 选择 \texttt{locale}
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo dpkg-reconfigure locales
\end{minted}
在这一长串列表中，只要选中
\begin{itemize}
\item[{$\boxtimes$}] \texttt{en\_US.UTF-8 UTF-8}
\item[{$\boxtimes$}] \texttt{zh\_CN.GB18030 GB18030}
\item[{$\boxtimes$}] \texttt{zh\_CN.UTF-8 UTF-8}
\end{itemize}
就可以了。默认语言环境选 \texttt{None} 。
\item 拷贝一个小配置文件：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo cp ~/dotfile/etc/default/locale /etc/default
\end{minted}
\item 顺带再拷贝一个小文件：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo cp ~/dotfile/etc/default/keyboard /etc/default
\end{minted}
这是把你的 \texttt{CapsLock} 键变成 \texttt{Ctrl} 键，
因为Unix用户经常要用 \texttt{Ctrl} 键，从来不用 \texttt{CapsLock} 。

好了，现在安装配置的工作基本就结束了。你可以重启一下系统。
系统重启后，看到的应该就是学院机房里那个没有桌面的“桌面系统”了。
不记得快捷键了？按 \texttt{Super-F1} 。

中文输入法，我选用的是 \texttt{fcitx}, 因为感觉它的bug要少一些，比较稳定。
如果你需要配置它的话，就：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
fcitx-configtool
\end{minted}
你最好和我一样，用 \texttt{Shift-space} 来激活输入法，因为 \texttt{Ctrl-space} 在Emacs里有特殊用途。

注意：fcitx依赖于dbus-x11，而显然fcitx软件包的维护者忽略了这个小细节。那么我们就自己把它装上呗：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo apt install dbus-x11
\end{minted}
\end{enumerate}

\section{附录：没有有线网卡怎么办？}
\label{sec:org3378f41}
办法很多：
\begin{enumerate}
\item 用Android手机的USB Tethering功能。以我自己的手机系统为例（LineageOS 15.1/Android 8.1），
很简单，
\begin{enumerate}
\item 用USB线连接手机和电脑；
\item 在手机的「系统设置」里有个搜索框，在里面输入“tethering”，马上就能找到“Hotspot \&
Tethering”，激活里面的USB Tethering功能就行了；
\item 在电脑上，敲命令 \texttt{ip a} 应该能看到一块有线网卡。比如，
\begin{verbatim}
3: enp2s0f4u2: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UNKNOWN group default qlen 1000
   link/ether 26:b1:c7:c5:02:1f brd ff:ff:ff:ff:ff:ff
\end{verbatim}
从上面的屏幕输出信息可以看到，这块有线网卡的名字是 \texttt{enp2s0f4u2} 。然后，以root身份，
敲下面这条命令：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo dhclient enp2s0f4u2
\end{minted}
你就可以获得一个IP地址了，也就是说，你已经成功联网了。
\end{enumerate}
\item 去找一个USB无线网卡试试。我找到一个Realtek的指甲盖大小的USB无线网卡，不需要驱动，插上就能用。我也尝试过两个比较古老的tp-link无线网卡，不好使。
\item 另外，如果你真的和我一样，用的是华为Honor Magicbook，那么也许你不必去找USB网卡，可以先试试能否让内置网卡工作。Magicbook的内置网卡是Intel的。既然完成后面的安装步骤之后它能正常工作，那我想，现在使使劲应该也能解决问题吧。但毕竟我还没有亲自尝试过，所以只能先给出一些想法：
\begin{itemize}
\item 之所以内置网卡暂时不工作，我怀疑是我们用来安装最小系统的iso文件不够新。它是以Debian稳定版（stretch）为基础做出来的，其中的内核（4.9）和相应固件（firmware-iwlwifi）都偏旧，
可能尚不支持这么新潮（2018年）的硬件。所以，可以试试把内核和相应固件从稳定版更新到测试版（buster）。在没有网络连接的情况下，显然这需要我们另找办法下载，并手动安装一些软件包，包括：
\begin{itemize}
\item \href{https://packages.debian.org/buster/linux-image-amd64}{linux-image-amd64}
\item \href{https://packages.debian.org/buster/firmware-iwlwifi}{firmware-iwlwifi}
\item 还有若干被上述两个软件包依赖的软件包
\end{itemize}
\item 一些参考链接：
\begin{itemize}
\item \href{https://unix.stackexchange.com/questions/283722/how-to-connect-to-wifi-from-command-line}{How to connect to WiFi from command line?}
\item \href{https://askubuntu.com/questions/974/how-can-i-install-software-or-packages-without-internet-offline}{How can I install software packages without Internet?}
\item \href{https://commandlinefanatic.com/cgi-bin/showarticle.cgi?article=art016}{Installing Debian without a Network}
\item \href{https://wiki.debian.org/WiFi}{Debian Wiki --- WiFi}
\end{itemize}
\end{itemize}
\item 如果上述办法都不成功，那么这招肯定行，就是笨点。直接去下面这些镜像站下载完整的安装盘。
\begin{itemize}
\item \url{http://mirrors.163.com/debian-cd/current/amd64/iso-dvd/}
\item \url{http://mirrors.ustc.edu.cn/debian-cd/current/amd64/iso-dvd/}
\end{itemize}

完整的DVD安装盘包含3个iso文件，你可以先下载第一个试试。如果里面有了你需要的无线网卡驱动和相关程序，那么激活网卡之后，你就可以直接网络安装了，无需下载其它的iso文件了。
\end{enumerate}

\subsection{无线联网时的密码设置}
\label{sec:orgc0a8978}
无线联网时通常是要输入密码的，所以我们需要修改一个配置文件 \texttt{/etc/network/interfaces} ，很简单，编辑这个小文件：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo nano /etc/network/interfaces
\end{minted}
\texttt{nano} 是个很简单的编辑器，用起来应该不会有什么困难吧。 
\texttt{nano} 窗口的最下两行都是快捷键提示，最重要的两个是：
\begin{enumerate}
\item 存盘： \texttt{Ctrl-o}
\item 退出： \texttt{Ctrl-x}
\end{enumerate}

在这个文件的最后加上如下几行：
\begin{verbatim}
iface tmp inet dhcp
wireless-essid MY-ESSID
wpa-ssid MY-ESSID
wpa-psk PASSWORD
\end{verbatim}
【注意】把 \texttt{MY-ESSID} 和 \texttt{PASSWORD} 换成你自己的无线网络的名字和密码。

然后，用下面这条命令来连接无线网：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo ifup WLANCARD=tmp
\end{minted}
【注意】把 \texttt{WLANCARD} 换成你自己的无线网卡的名字，网卡的名字通常是w开头的，比如我的无线网卡名字就是 \texttt{wlp1s0} ，那么我用的联网命令就是：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo ifup wlp1s0=tmp
\end{minted}
