linux/tutorials/install/install.org
* 附录：关于硬件配置
:PROPERTIES:
:CUSTOM_ID: app3
:END:

首先，当然是要搞清楚你到底有哪些硬件。很简单：
#+BEGIN_SRC sh
lspci
#想看更详细的信息，就：
lspci -vvv
#+END_SRC

总之， =lspci= 能列出你所有外围设备的详细信息。然后，如果
你的有线或无线网卡是Realtek，或者Atheros牌子的，那么你需要安装相应的firmware（固件）。
#+BEGIN_SRC sh
#如果是Realtek网卡，就：
sudo apt install firmware-realtek
#如果是Atheros网卡，就：
sudo apt install firmware-atheros
#如果是Intel网卡，就：
sudo apt install firmware-iwlwifi
#+END_SRC

并不是所有的网卡都需要安装相应的固件，甚至上面提到的Realtek, Atheros, Intel网卡，即使不
装固件，网卡也可能工作，但未必那么稳定。所以，既然有固件，那还是装上比较
好。同样，针对声卡、显卡，Debian库里也有很多固件。下面这条命令可以列出库里所有的固件包：
#+BEGIN_SRC sh
aptitude search ^firmware
#+END_SRC
大概也就三十几个吧。找找有没有和你的硬件相关的。怎么知道是否相关呢？看看固件包的详细信
息呗，比如：
#+BEGIN_SRC sh
apt show firmware-atheros
#+END_SRC
于是就知道了这个固件适用于哪些网卡。

关于显卡，听说Nvidia显卡比较难伺候，好在我从来没碰到过，因为只有游戏本才配置这么贵的显
卡。如果你（曾经人品不好）不幸碰到了，那么，省事起见，我建议你暂时不要用它，就用主板上内置
的（通常是Intel）显卡就好。直到有一天你成了一个熟练的Linux用户之后，再把它激活。
* 附录：LaTeX （非必须）
在Linux平台，你不用非要学习使用LaTeX来排版你的文章、报告、论文，
因为你已经有了一套开源的office软件。如果前面的事情你都顺利完成了，那么现在只需要按
=Super-o= （键盘上那个Win键，我们叫它Super键）
就可以调出著名的Libreoffice了。然后，你完全可以像在Windows平台上那样写东西。

但是，「你们这些使用Linux的人，不就是“装逼、扮酷”嘛」，既然他嫌你酷，那么你就再酷一点嘛。
TeXLive是一套优秀而庞大的排版系统，我们只需要安装使用它提供的少数十几个软件包就够了。

我个人用到的LaTeX软件包列表在[[http://cs2.swfu.edu.cn/~wx672/debian-install/list.texlive][这里]]：
: $ wget http://cs2.swfu.edu.cn/~wx672/debian-install/list.texlive
: $ sudo apt install `cat list.texlive`
上面这两行命令和我们前面用到的很相似吧。第一行是下载 =list.texlive= 文件，
也就是我的TeXLive软件包列表。第二行是安装文件里的所有软件包。
安装好以后，如果想“酷”，那么你要做如下几件事情：
1. 熟悉Emacs的使用。为什么非要用Emacs啊？因为它为编辑LaTeX文件提供了最好的支持。而且，我不
   想在这里唠唠叨叨，如果你想看我为Emacs做的广告，可以看我在「知乎」上写的一个小答案：
   - https://www.zhihu.com/question/30955165/answer/70799403
     
   顺带贩卖一下我为Debian做的广告：
   - https://www.zhihu.com/question/19676224/answer/29321011
     
2. 学习一点关于LaTeX的基础知识，我觉得两三个小时应该够了吧。我推荐 =lshort=:
   : texdoc -l lshort
   上面这条命令会列出几个相关的PDF文件，你要关注的是前两个：
   : 1 /usr/share/texlive/texmf-dist/doc/latex/lshort-english/lshort.pdf
   : 2 /usr/share/texlive/texmf-dist/doc/latex/lshort-chinese/lshort-zh-cn.pdf
   我鼓励你看英文原版，至少应该中英对照着看吧。
3. 如果你打算尝试用LaTeX来写你的毕业论文，那么我为你提供了点小帮助：
   - https://github.com/wx672/texmf/tree/master/doc/latex/swfu/swfcthesis
   - http://cs2.swfu.edu.cn/~wx672/texmf/doc/latex/swfu/swfcthesis/
   上面两个链接里的内容是一样的，看哪个都行。有问题可以向我求助。
   
   Happy LaTeXing!

