linux/tutorials/install/install.tex

\section{附录：关于硬件配置}
\label{sec:org57926af}
首先，当然是要搞清楚你到底有哪些硬件。很简单：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
lspci
#想看更详细的信息，就：
lspci -vvv
\end{minted}

总之， \texttt{lspci} 能列出你所有外围设备的详细信息。然后，如果你的有线或无线网卡是Realtek，或者Atheros牌子的，那么你需要安装相应的firmware（固件）。
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
#如果是Realtek网卡，就：
sudo apt install firmware-realtek
#如果是Atheros网卡，就：
sudo apt install firmware-atheros
#如果是Intel网卡，就：
sudo apt install firmware-iwlwifi
\end{minted}

并不是所有的网卡都需要安装相应的固件，甚至上面提到的Realtek, Atheros, Intel网卡，即使不装固件，网卡也可能工作，但未必那么稳定。所以，既然有固件，那还是装上比较好。同样，针对声卡、显卡，Debian库里也有很多固件。下面这条命令可以列出库里所有的固件包：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
aptitude search ^firmware
\end{minted}
大概也就三十几个吧。找找有没有和你的硬件相关的。怎么知道是否相关呢？看看固件包的详细信息呗，比如：
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
apt show firmware-atheros
\end{minted}
于是就知道了这个固件适用于哪些网卡。

关于显卡，听说Nvidia显卡比较难伺候，好在我从来没碰到过，因为只有游戏本才配置这么贵的显卡。如果你（曾经人品不好）不幸碰到了，那么，省事起见，我建议你暂时不要用它，就用主板上内置的（通常是Intel）显卡就好。直到有一天你成了一个熟练的Linux用户之后，再把它激活。
\section{附录：\LaTeX{} （非必须）}
\label{sec:org393216c}
在Linux平台，你不用非要学习使用\LaTeX{}来排版你的文章、报告、论文，
因为你已经有了一套开源的office软件。如果前面的事情你都顺利完成了，那么现在只需要按
\texttt{Super-o} （键盘上那个Win键，我们叫它Super键）
就可以调出著名的Libreoffice了。然后，你完全可以像在Windows平台上那样写东西。

但是，「你们这些使用Linux的人，不就是“装逼、扮酷”嘛」，既然他嫌你酷，那么你就再酷一点嘛。
TeXLive是一套优秀而庞大的排版系统，我们只需要安装使用它提供的少数十几个软件包就够了。

我个人用到的\LaTeX{}软件包列表在\href{http://cs2.swfu.edu.cn/\~wx672/debian-install/list.texlive}{这里}：
\begin{verbatim}
$ wget http://cs2.swfu.edu.cn/~wx672/debian-install/list.texlive
$ sudo apt install `cat list.texlive`
\end{verbatim}

上面这两行命令和我们前面用到的很相似吧。第一行是下载 \texttt{list.texlive} 文件，
也就是我的TeXLive软件包列表。第二行是安装文件里的所有软件包。
安装好以后，如果想“酷”，那么你要做如下几件事情：
\begin{enumerate}
\item 熟悉Emacs的使用。为什么非要用Emacs啊？因为它为编辑\LaTeX{}文件提供了最好的支持。而且，我不想在这里唠唠叨叨，如果你想看我为Emacs做的广告，可以看我在「知乎」上写的一个小答案：
\begin{itemize}
\item \url{https://www.zhihu.com/question/30955165/answer/70799403}
\end{itemize}

顺带贩卖一下我为Debian做的广告：
\begin{itemize}
\item \url{https://www.zhihu.com/question/19676224/answer/29321011}
\end{itemize}

\item 学习一点关于\LaTeX{}的基础知识，我觉得两三个小时应该够了吧。我推荐 \texttt{lshort}:
\begin{verbatim}
texdoc -l lshort
\end{verbatim}

上面这条命令会列出几个相关的PDF文件，你要关注的是前两个：
\begin{verbatim}
1 /usr/share/texlive/texmf-dist/doc/latex/lshort-english/lshort.pdf
2 /usr/share/texlive/texmf-dist/doc/latex/lshort-chinese/lshort-zh-cn.pdf
\end{verbatim}

我鼓励你看英文原版，至少应该中英对照着看吧。
\item 如果你打算尝试用\LaTeX{}来写你的毕业论文，那么我为你提供了点小帮助：
\begin{itemize}
\item \url{https://github.com/wx672/texmf/tree/master/doc/latex/swfu/swfcthesis}
\item \url{http://cs2.swfu.edu.cn/\~wx672/texmf/doc/latex/swfu/swfcthesis/}
\end{itemize}
上面两个链接里的内容是一样的，看哪个都行。有问题可以向我求助。

Happy LaTeXing!
\end{enumerate}
\end{document}